#### Terraform Format and Style `failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan `success`
<details><summary>Show Plan</summary>
```

terraform
google_api_gateway_api.api: Refreshing state... [id=projects/mh-api-389212/locations/global/apis/mh-api]
data.google_iam_policy.admin: Reading...
google_iam_workload_identity_pool.terraform-pool: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool]
data.google_iam_policy.admin: Read complete after 0s [id=3039879987]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=mh-api-389212/cloudresourcemanager.googleapis.com]
data.google_service_account.terraform_sa: Reading...
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=mh-api-389212/sts.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=mh-api-389212/iam.googleapis.com]
data.google_iam_policy.auth: Reading...
data.google_iam_policy.auth: Read complete after 0s [id=344321828]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=mh-api-389212/iamcredentials.googleapis.com]
google_cloud_run_service.stg-mh-api: Refreshing state... [id=locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-api]
google_iam_workload_identity_pool_provider.terraform-provider: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool/providers/terraform-provider]
google_api_gateway_api_config.api_cfg: Refreshing state... [id=projects/mh-api-389212/locations/global/apis/mh-api/configs/mh-api]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/650836814988/locations/global/workloadIdentityPools/terraform-pool/attribute.repository/o-ga09/MH-API]
google_api_gateway_api_config_iam_policy.policy: Refreshing state... [id=projects/mh-api-389212/locations/global/apis/mh-api/configs/mh-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.stg-mh-api is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "stg-mh-api" {
      ~ id                         = "locations/asia-northeast1/namespaces/mh-api-389212/services/stg-mh-api" -> (known after apply)
        name                       = "stg-mh-api"
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/stg-mh-api:latest' not found."
                      - reason  = ""
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Image 'asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/stg-mh-api:latest' not found."
                      - reason  = ""
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "stg-mh-api-00001-497"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - traffic                      = []
              - url                          = ""
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/ingress"       = "all"
              - "run.googleapis.com/operation-id"  = "3221cdc0-7246-4f9c-ad7e-63e5e4151a48"
              - "serving.knative.dev/creator"      = "terraform@mh-api-389212.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier" = "terraform@mh-api-389212.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 1 -> null
          - labels                = {} -> null
          - namespace             = "mh-api-389212" -> null
          - resource_version      = "AAYJYJri/cI" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/650836814988/services/stg-mh-api" -> null
          - terraform_labels      = {} -> null
          - uid                   = "d53ae0d5-6f2d-4c51-8c89-2e84af39ee5c" -> null
        }

      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Custom"
                } -> null
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/stg-mh-api:latest" -> "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/stg-mh-api:142120a9672fe818aee6e2eeb4be8666e7925fc6"
                  + name    = (known after apply)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                    # (1 unchanged block hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service_iam_policy.auth will be created
  + resource "google_cloud_run_service_iam_policy" "auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-api"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @o-ga09, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*